app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $stats = [
            'totalTransaksi' => (new TransaksiModel())->countAllResults(),
            'totalBahan'     => (new BahanModel())->countAllResults(),
            'totalPelanggan' => (new PelangganModel())->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
SELECT COUNT(*) AS `numrows`
FROM `bahan`
SELECT COUNT(*) AS `numrows`
FROM `pelanggan`