app/Controllers/Admin/LayananController.php

SELECT *
FROM `layanan`
---
    public function index()
    {
        $model = new \App\Models\LayananModel();
        $layanan = $model->findAll();