app/Controllers/Admin/PelangganController.php

    public function index()
{
    $data['pelanggan'] = $this->model->paginate(10);
---
SELECT *
FROM `pelanggan`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pelanggan`