app/Controllers/AuthController.php

    public function attempt()
    {
        $u = $this->request->getPost('username');
        $p = $this->request->getPost('password');


        $pelangganModel = new \App\Models\PelangganModel();
        $pelanggan = $pelangganModel->where('username', $u)->first();

        if ($pelanggan && password_verify($p, $pelanggan['password_hash'])) {
            session()->set([
                'isLoggedIn' => true,
                'pelanggan_id' => $pelanggan['id'],
                'username'   => $pelanggan['username'],
                'nama'       => $pelanggan['nama'],
                'role'       => 'pelanggan',
            ]);
            return redirect()->to('/pelanggan/dashboard');
        }

        $model = new UserAppModel();
        $user = $model->where('username', $u)->first();
---
SELECT *
FROM `pelanggan`
WHERE `username` = 'admin'
 LIMIT 1
SELECT *
FROM `user_app`
WHERE `username` = 'admin'
 LIMIT 1